Revit 2027 API
View.GetColorFillSchemeId Method
 Returns id of the color fill scheme element applied to the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetColorFillSchemeId(
	ElementId categoryId
)
Public Function GetColorFillSchemeId (
	categoryId As ElementId
) As ElementId
public:
ElementId^ GetColorFillSchemeId(
	ElementId^ categoryId
)
member GetColorFillSchemeId :
        categoryId : ElementId -> ElementId
Parameters
categoryId ElementId
 The id of the category which the color fill scheme element belongs to.
Return Value
ElementId
 The id of the color fill scheme element.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
View Class
Autodesk.Revit.DB Namespace